common/models/Profile.php

SELECT * FROM `user_cards` WHERE (`user_id`=1) AND (`card_id`=2) AND (`status`=1)
SELECT * FROM `user` WHERE `id`=1
---
    public function getCard(){
        return UserCards::findOne(['user_id' => $this->user->id, 'card_id' => $this->main_card, 'status' => 1]);