common/models/User.php

SELECT * FROM `user` WHERE `auth_key`='RU-ZgsCg9fCFPEEaAb2s1F7v685F_3Ri'
---
    public static function findByAuthKey($auth){
        return User::findOne(['auth_key' => $auth]);

SELECT * FROM `user_cards` WHERE (`user_id`=1) AND (`status`=1) ORDER BY `created_at` DESC
---
    public function getCards(){
        return UserCards::find()->where(['user_id' => $this->id, 'status' => 1])->orderBy(['created_at' => SORT_DESC])->all();