backend/modules/api/controllers/CardsController.php

    public function actionGetcards(){
        \Yii::$app->response->format = Response::FORMAT_JSON;

        $authkey = Yii::$app->request->post('auth_key');

        if (strlen($authkey) > 10){
            $user = User::findByAuthKey($authkey);

            if ($user){
                $a = [];
                $i = 0;
                foreach ($user->cards as $card){

                    $card->public_key = sha1('Shakh'.$card->card_id.$card->card->exp_date.time());
                    $card->save();
---
UPDATE `user_cards` SET `public_key`='b2cae1e15c402e501a63b384a21294e251119b43' WHERE `id`=2