backend/modules/api/controllers/CardsController.php

SELECT * FROM `user_cards` WHERE (`user_id`=1) AND (`card_id`='2') AND (`status`=1)
---
    public function actionSetmaincard(){
        \Yii::$app->response->format = Response::FORMAT_JSON;

        $authkey = Yii::$app->request->post('auth_key');
        $cardid = Yii::$app->request->post('card_id');

        if ($authkey && $cardid && strlen($authkey) > 0 && strlen($cardid) > 0){
            $user = User::findByAuthKey($authkey);
            $usercard = UserCards::findOne(['user_id' => $user->id, 'id' => $cardid, 'status' => 1]);

SELECT * FROM `profile` WHERE `user_id`=1
UPDATE `user_cards` SET `public_key`='1ac0fb81b613288dea7bde2035acc5121995fb67' WHERE `id`=2
---
    public function actionGetmaincard(){
        \Yii::$app->response->format = Response::FORMAT_JSON;

        $authkey = Yii::$app->request->post('auth_key');

        if (strlen($authkey) > 10){
            $user = User::findByAuthKey($authkey);
            if ($user){

                $maincard = UserCards::findOne(['id' => $user->profile->main_card, 'status' => 1]);

                if ($maincard->card){

                    $card = $maincard;
                    //generate key for card -----------------------------

                    $card->public_key = sha1('Shakh'.$card->card->id.$card->card->exp_date.time());
                    $card->save();