backend/modules/api/models/UserCards.php

SELECT * FROM `cards` WHERE (`id`=2) AND (`status`=1)
---
    public function getCard(){
        return Cards::find()->where(['id' => $this->id, 'status' => 1])->one();